
const menu = (prefix, sender, NickDono, NomeBot, data, hora, NumberDono, version) => {
	
return `╭━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╮
┃ 🌑💜 ⟡ 𝐁𝐋𝐀𝐂𝐊 𝐋𝐎𝐓𝐔𝐒 𝐒𝐘𝐒𝐓𝐄𝐌 ⟡ 💜🌑
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃ 👤 𝐔𝐬𝐮𝐚́𝐫𝐢𝐨: @${sender?.split("@")[0]}
┃ 📅 𝐃𝐚𝐭𝐚: ${data}
┃ 🕒 𝐇𝐨𝐫𝐚: ${hora}
┃ 👑 𝐃𝐨𝐧𝐨: ${NickDono}
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃
┃ 👮‍♂️ 𝐀𝐃𝐌𝐈𝐍𝐈𝐒𝐓𝐑𝐀𝐂̧𝐀̃𝐎
┃ ⟡⃟🌑 ${prefix}ban   
┃⟡⃟🌑 ${prefix}kick
┃⟡⃟🌑 ${prefix}promover  
┃⟡⃟🌑 ${prefix}rebaixar
┃⟡⃟🌑 ${prefix}linkgp
┃⟡⃟🌑 ${prefix}antilink
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃
┃ 🎄 𝐁𝐎𝐀𝐒-𝐕𝐈𝐍𝐃𝐀𝐒
┃⟡⃟🌑 ${prefix}bemvindo
┃⟡⃟🌑 ${prefix}legendabv
┃⟡⃟🌑 ${prefix}legendasaiu
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃
┃ 🎁 𝐅𝐈𝐆𝐔𝐑𝐈𝐍𝐇𝐀𝐒
┃⟡⃟🌑 ${prefix}sticker   
┃⟡⃟🌑 ${prefix}toimg
┃⟡⃟🌑 ${prefix}figurinhas
┃⟡⃟🌑 ${prefix}pack (tema)
┃⟡⃟🌑 ${prefix}criarpack
┃⟡⃟🌑 ${prefix}finalizarpack
┃⟡⃟🌑 ${prefix}figu_memes
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃
┃ 📥 𝐃𝐎𝐖𝐍𝐋𝐎𝐀𝐃𝐒
┃⟡⃟🌑 ${prefix}play
┃⟡⃟🌑 ${prefix}play_video
┃⟡⃟🌑 ${prefix}tiktokdl
┃⟡⃟🌑 ${prefix}instadl
┃⟡⃟🌑 ${prefix}Spotify 
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃
┃ 🧠 𝐈𝐍𝐓𝐄𝐋𝐈𝐆𝐄̂𝐍𝐂𝐈𝐀 𝐀𝐑𝐓𝐈𝐅𝐈𝐂𝐈𝐀𝐋
┃⟡⃟🌑 ${prefix}lotus (ia)
┃⟡⃟🌑 ${prefix}deepsearch
┃⟡⃟🌑 ${prefix}gpt
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃
┃ 🎮 𝐉𝐎𝐆𝐎𝐒 𝐃𝐄 𝐆𝐑𝐔𝐏𝐎
┃⟡⃟🌑 ${prefix}roletarussa
┃⟡⃟🌑 ${prefix}apostar
┃⟡⃟🌑 ${prefix}caraoucoroa
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃
┃ 🎲 𝐑𝐏𝐆: 𝐒𝐄𝐒𝐒𝐎̃𝐄𝐒 𝐄𝐌 𝐆𝐑𝐔𝐏𝐎
┃⟡⃟🌑 ${prefix}rpg (Ajuda)
┃⟡⃟🌑 ${prefix}criarsessao [tema]
┃⟡⃟🌑 ${prefix}entrar (Na mesa)
┃⟡⃟🌑 ${prefix}narrar [ação]
┃⟡⃟🌑 ${prefix}batalha (Em grupo)
┃⟡⃟🌑 ${prefix}meuchar
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃
┃ 🤖 𝐒𝐈𝐒𝐓𝐄𝐌𝐀
┃⟡⃟🌑 ${prefix}setprefix
┃⟡⃟🌑 ${prefix}reiniciar
┃⟡⃟🌑 ${prefix}botoff
┃⟡⃟🌑 ${prefix}boton
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃
┃ 📜 𝐌𝐄𝐍𝐔𝐒 𝐄𝐗𝐓𝐑𝐀𝐒
┃⟡⃟🌑 ${prefix}menuadm
┃⟡⃟🌑 ${prefix}menudown
┃⟡⃟🌑 ${prefix}menufig
┃⟡⃟🌑 ${prefix}menudono
╰━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╯

🌑💜 ⟡ 𝙋𝙤𝙙𝙚𝙧 𝙣𝙖𝙨 𝙎𝙤𝙢𝙗𝙧𝙖𝙨 ⟡ 💜🌑`;

};
exports.menu = menu;

const menuadm = (prefix, sender) => {
return `╭━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╮
┃ 🌑💜 ⟡ 𝐏𝐀𝐈𝐍𝐄𝐋 𝐃𝐄 𝐂𝐎𝐍𝐓𝐑𝐎𝐋𝐄 ⟡ 💜🌑
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃ ✦ Olá, @${sender?.split("@")[0]}!
┃ ⟡⃟💜 Modo Moderador Ativo
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖

╭━╾❖╼━ 🌑💜 𝐆𝐑𝐔𝐏𝐎 💜🌑 ━╾❖╼━╮
┃⟡⃟🌑 ${prefix}ativar
┃⟡⃟🌑 ${prefix}desativar
┃⟡⃟🌑 ${prefix}linkgp
┃⟡⃟🌑 ${prefix}antilink (1/0)
┃⟡⃟🌑 ${prefix}antilinkhard (1/0)
┃⟡⃟🌑 ${prefix}so_adm
╰━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╯

╭━╾❖╼━ 🌑💜 𝐌𝐄𝐍𝐒𝐀𝐆𝐄𝐍𝐒 💜🌑 ━╾❖╼━╮
┃⟡⃟🌑 ${prefix}bemvindo (1/0)
┃⟡⃟🌑 ${prefix}welcome (1/0)
┃⟡⃟🌑 ${prefix}legendabv
┃⟡⃟🌑 ${prefix}legendasaiu
┃⟡⃟🌑 ${prefix}bemvindo2 (1/0)
┃⟡⃟🌑 ${prefix}legendabv2
╰━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╯

╭━╾❖╼━ 🌑💜 𝐌𝐎𝐃𝐄𝐑𝐀𝐂̧𝐀̃𝐎 💜🌑 ━╾❖╼━╮
┃⟡⃟🌑 ${prefix}promover (@)
┃⟡⃟🌑 ${prefix}rebaixar (@)
┃⟡⃟🌑 ${prefix}ban (@)
┃⟡⃟🌑 ${prefix}totag
┃⟡⃟🌑 ${prefix}fakechat 
╰━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╯

🌑💜 ⟡ 𝘽𝙡𝙖𝙘𝙠 𝙇𝙤𝙩𝙪𝙨 𝙎𝙚𝙘𝙪𝙧𝙞𝙩𝙮 ⟡ 💜🌑`;

};
exports.menuadm = menuadm;


const menuStickers = (prefix, sender) => {
return `╭━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╮
┃ 🌑💜 ⟡ 𝐅𝐈𝐆𝐔𝐑𝐈𝐍𝐇𝐀𝐒 𝐒𝐘𝐒𝐓𝐄𝐌 ⟡ 💜🌑
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖

╭━╾❖╼━ 🌑💜 𝐂𝐑𝐈𝐀𝐂̧𝐀̃𝐎 💜🌑 ━╾❖╼━╮
┃⟡⃟🌑 ${prefix}s
┃⟡⃟🌑 ${prefix}brat
┃⟡⃟🌑 ${prefix}sticker
┃⟡⃟🌑 ${prefix}toimg
┃⟡⃟🌑 ${prefix}rename
┃⟡⃟🌑 ${prefix}criarpack
┃⟡⃟🌑 ${prefix}finalizarpack
╰━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╯

╭━╾❖╼━ 🌑💜 𝐏𝐀𝐂𝐎𝐓𝐄𝐒 💜🌑 ━╾❖╼━╮
┃⟡⃟🌑 ${prefix}pack (tema)
┃⟡⃟🌑 ${prefix}figurinhas
┃⟡⃟🌑 ${prefix}figu_memes
┃⟡⃟🌑 ${prefix}figu_anime
┃⟡⃟🌑 ${prefix}figu_animais
╰━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╯

🌑💜 ⟡ 𝙎𝙩𝙞𝙘𝙠𝙚𝙧 𝙈𝙖𝙨𝙩𝙚𝙧𝙮 ⟡ 💜🌑`;
}

exports.menuStickers = menuStickers;

const menu18 = (prefix, sender) => {
return `╭━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╮
┃ 🌑💜 ⟡ 𝐁𝐋𝐀𝐂𝐊 𝐒𝐄𝐂𝐑𝐄𝐓 ⟡ 💜🌑
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃ ⚠️ Acesso Restrito
┃ ⟡⃟💜 Conteúdo Sensível
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖

╭━╾❖╼━ 🌑💜 𝐏𝐀𝐂𝐎𝐓𝐄𝐒 💜🌑 ━╾❖╼━╮
┃⟡⃟🌑 ${prefix}plaq1 até ${prefix}plaq11
╰━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╯

🌑💜 ⟡ 𝙉𝙞𝙜𝙝𝙩 𝙑𝙞𝙗𝙚𝙨 ⟡ 💜🌑`;

};

exports.menu18 = menu18;

const menuDono = (prefix, sender) => {
return `╭━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╮
┃ 🌑💜 ⟡ 𝐂𝐎𝐍𝐓𝐑𝐎𝐋𝐄 𝐒𝐔𝐏𝐑𝐄𝐌𝐎 ⟡ 💜🌑
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖
┃ 👑✦ Olá, Criador!
┃ ⟡⃟💜 Núcleo Central Liberado
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖

╭━╾❖╼━ 🌑💜 𝐂𝐎𝐍𝐅𝐈𝐆 💜🌑 ━╾❖╼━╮
┃⟡⃟🌑 ${prefix}setprefix
┃⟡⃟🌑 ${prefix}nome-bot
┃⟡⃟🌑 ${prefix}nick-dono
┃⟡⃟🌑 ${prefix}totalcases
┃⟡⃟🌑 ${prefix}getcase
╰━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╯

╭━╾❖╼━ 🌑💜 𝐒𝐈𝐒𝐓𝐄𝐌𝐀 💜🌑 ━╾❖╼━╮
┃⟡⃟🌑 ${prefix}reiniciar
┃⟡⃟🌑 ${prefix}bot (on/off)
┃⟡⃟🌑 ${prefix}bangp
┃⟡⃟🌑 ${prefix}unbangp
╰━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╯

🌑💜 ⟡ 𝘼𝙗𝙨𝙤𝙡𝙪𝙩𝙚 𝘾𝙤𝙣𝙩𝙧𝙤𝙡 ⟡ 💜🌑`;

};
exports.menuDono = menuDono;

const menuDown = (prefix, sender) => {
return `╭━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╮
┃ 🌑💜 ⟡ 𝐂𝐄𝐍𝐓𝐑𝐀𝐋 𝐃𝐄 𝐌𝐈𝐃𝐈𝐀 ⟡ 💜🌑
┃╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖╾━╼❖

╭━╾❖╼━ 🌑💜 𝐏𝐋𝐀𝐘𝐄𝐑 💜🌑 ━╾❖╼━╮
┃⟡⃟🌑 ${prefix}play
┃⟡⃟🌑 ${prefix}play_video
┃⟡⃟🌑 ${prefix}rvisu
╰━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╯

╭━╾❖╼━ 🌑💜 𝐃𝐎𝐖𝐍𝐋𝐎𝐀𝐃 💜🌑 ━╾❖╼━╮
┃⟡⃟🌑 ${prefix}tiktokdl
┃⟡⃟🌑 ${prefix}instadl
┃⟡⃟🌑 ${prefix}Spotify
╰━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╾❖╼━╯

🌑💜 ⟡ 𝙈𝙚𝙙𝙞𝙖 𝙎𝙮𝙨𝙩𝙚𝙢 ⟡ 💜🌑`;
};
exports.menuDown = menuDown;
